app/controllers/blogs_controller.rb

    def index
        @comments = Comment.all
---
SELECT `comments`.* FROM `comments` ORDER BY id desk

    def create
        Comment.create(title: comment_params[:title],image: comment_params[:image], text: comment_params[:text], user_id: current_user.id)
---
INSERT INTO `comments` (`text`, `image`, `user_id`, `created_at`, `updated_at`, `title`) VALUES ('ddddddddddd', 'dddddddd', 2, '2019-04-14 06:43:47', '2019-04-14 06:43:47', 'ddddddddd')

    def edit
        @comment = Comment.find(params[:id])
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 5 LIMIT 1

    def update
        comment = Comment.find(params[:id])
        comment.update(comment_params) if comment.user_id == current_user.id
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 5 LIMIT 1
UPDATE `comments` SET `image` = 'https://tech-master.s3.amazonaws.com/uploads/curriculums/images/Rails1-4/sample.jpg', `updated_at` = '2019-04-14 12:39:50' WHERE `comments`.`id` = 9

    def destroy
        comment = Comment.find(params[:id])
        comment.destroy if comment.user_id == current_user.id
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 5 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 5

    def show

        @comments = Comment.all
---
SELECT `comments`.* FROM `comments`